var LOCATION_DATA = {
  "_ver": 1,
  "_time": "2026-05-14T07:56:34.431Z",
  "grass": [
    {
      "id": 2,
      "name": "南门右侧草坪",
      "type": "rect",
      "x": 58,
      "z": 203,
      "w": 50,
      "h": 20,
      "color": 6986330
    },
    {
      "id": 3,
      "name": "南门左侧草坪",
      "type": "rect",
      "x": -59,
      "z": 202,
      "w": 50,
      "h": 20,
      "color": 6986330
    },
    {
      "id": 4,
      "name": "东侧教学楼内庭草坪",
      "type": "rect",
      "x": 62,
      "z": 161,
      "w": 40,
      "h": 24,
      "color": 6986330
    },
    {
      "id": 5,
      "name": "西侧教学楼内庭草坪",
      "type": "rect",
      "x": -62,
      "z": 161,
      "w": 40,
      "h": 24,
      "color": 6986330
    },
    {
      "id": 12,
      "name": "教学区东侧边缘绿地",
      "type": "rect",
      "x": 96,
      "z": 155,
      "w": 10,
      "h": 150,
      "color": 6986330
    },
    {
      "id": 13,
      "name": "教学区西侧边缘绿地",
      "type": "rect",
      "x": -96,
      "z": 155,
      "w": 10,
      "h": 150,
      "color": 6986330
    },
    {
      "id": 100,
      "name": "图书馆东侧绿地",
      "type": "rect",
      "x": 128,
      "z": 25,
      "w": 75,
      "h": 50,
      "color": 6986330
    },
    {
      "id": 102,
      "name": "体育馆周边绿地",
      "type": "rect",
      "x": 204,
      "z": -138,
      "w": 60,
      "h": 80,
      "color": 6986330
    },
    {
      "id": 103,
      "name": "生活区绿地",
      "type": "rect",
      "x": 219,
      "z": 34,
      "w": 60,
      "h": 30,
      "color": 6986330
    },
    {
      "id": 104,
      "name": "图书馆前草坪（左）",
      "type": "rect",
      "x": -21,
      "z": 78,
      "w": 30,
      "h": 20,
      "color": 6986330
    },
    {
      "id": 105,
      "name": "图书馆前草坪（右）",
      "type": "rect",
      "x": 17,
      "z": 78,
      "w": 30,
      "h": 20,
      "color": 6986330
    },
    {
      "id": 106,
      "name": "核心区草坪（左）",
      "type": "rect",
      "x": -21,
      "z": 106,
      "w": 30,
      "h": 20,
      "color": 6986330
    },
    {
      "id": 107,
      "name": "核心区草坪（右）",
      "type": "rect",
      "x": 17,
      "z": 106,
      "w": 30,
      "h": 20,
      "color": 6986330
    },
    {
      "id": 108,
      "name": "12号楼西侧绿地",
      "type": "rect",
      "x": 90,
      "z": -129,
      "w": 10,
      "h": 20,
      "color": 6986330
    },
    {
      "id": 100,
      "name": "图书馆右边草坪",
      "type": "rect",
      "x": 58,
      "z": 33,
      "color": 6986330,
      "w": 25,
      "h": 35
    },
    {
      "id": 101,
      "name": "外围草坪",
      "type": "rect",
      "x": -54,
      "z": 225,
      "color": 6986330,
      "w": 90,
      "h": 10
    },
    {
      "id": 102,
      "name": "新草坪_17",
      "type": "rect",
      "x": 54,
      "z": 225,
      "color": 6986330,
      "w": 90,
      "h": 10
    },
    {
      "id": 100,
      "name": "新草坪_18",
      "type": "rect",
      "x": 201,
      "z": -311,
      "color": 6986330,
      "w": 30,
      "h": 10
    }
  ],
  "buildings": [
    {
      "id": "C-CORE-01",
      "name": "贺田图书馆/树兰国际医学院",
      "x": -4,
      "z": 41,
      "w": 100,
      "d": 50,
      "h": 70,
      "shape": "library",
      "color": 15260868,
      "zone": "核心区",
      "pri": "high",
      "desc": "校园核心地标，集图书馆与医学院于一体，底部裙房+中央塔楼。",
      "glb": "library1.glb",
      "glbScale": 0.68,
      "glbRotY": 270
    },
    {
      "id": "C-CORE-02",
      "name": "树人礼堂",
      "x": -40,
      "z": -34,
      "w": 40,
      "d": 30,
      "h": 15,
      "shape": "rect",
      "color": 14209216,
      "zone": "核心区",
      "pri": "high",
      "desc": "校园大礼堂，承办大型活动和学术报告。"
    },
    {
      "id": "C-CORE-03",
      "name": "20号楼（信息学院第二实验大楼）",
      "x": 59,
      "z": -35,
      "w": 50,
      "d": 16,
      "h": 39,
      "shape": "rect",
      "color": 14735560,
      "zone": "核心区",
      "pri": "high",
      "desc": "信息科技学院实验教学楼，5 层。"
    },
    {
      "id": "S-EDU-00",
      "name": "南校区南门",
      "x": -2,
      "z": 225,
      "w": 14,
      "d": 4,
      "h": 7,
      "shape": "gate",
      "color": 13156528,
      "zone": "教学区",
      "pri": "high",
      "desc": "校园南侧主入口。"
    },
    {
      "id": "S-EDU-01",
      "name": "教学主楼 A1",
      "x": 58,
      "z": 183,
      "w": 50,
      "d": 14,
      "h": 24,
      "shape": "rect",
      "color": 15260868,
      "zone": "教学区",
      "pri": "high",
      "desc": "南区东侧教学主楼，6 层。"
    },
    {
      "id": "S-EDU-02",
      "name": "教学主楼 A2",
      "x": -58,
      "z": 183,
      "w": 50,
      "d": 14,
      "h": 24,
      "shape": "rect",
      "color": 15260868,
      "zone": "教学区",
      "pri": "high",
      "desc": "南区西侧教学主楼，6 层。"
    },
    {
      "id": "S-EDU-04",
      "name": "教学主楼 A4",
      "x": -58,
      "z": 140,
      "w": 50,
      "d": 14,
      "h": 24,
      "shape": "rect",
      "color": 15260868,
      "zone": "教学区",
      "pri": "high",
      "desc": "西侧教学主楼，6 层。"
    },
    {
      "id": "S-EDU-05",
      "name": "裙房 B1",
      "x": 68,
      "z": 107,
      "w": 30,
      "d": 50,
      "h": 15,
      "shape": "rect",
      "color": 13683904,
      "zone": "教学区",
      "pri": "medium",
      "desc": "教学区附属裙房，2 层。"
    },
    {
      "id": "S-EDU-06",
      "name": "裙房 B2",
      "x": -68,
      "z": 107,
      "w": 30,
      "d": 50,
      "h": 15,
      "shape": "rect",
      "color": 13683904,
      "zone": "教学区",
      "pri": "medium",
      "desc": "教学区附属裙房，2 层。"
    },
    {
      "id": "W-EDU-01",
      "name": "树人之家",
      "x": -240,
      "z": -34,
      "w": 35,
      "d": 50,
      "h": 30,
      "shape": "rect",
      "color": 14209224,
      "zone": "教学区",
      "pri": "medium",
      "desc": "西侧综合服务建筑，4 层。"
    },
    {
      "id": "W-EDU-02",
      "name": "15号楼",
      "x": -180,
      "z": -69,
      "w": 40,
      "d": 14,
      "h": 20,
      "shape": "rect",
      "color": 14472388,
      "zone": "教学区",
      "pri": "medium",
      "desc": "西侧教学楼，5 层。"
    },
    {
      "id": "W-EDU-03",
      "name": "17号楼",
      "x": -174,
      "z": 8,
      "w": 40,
      "d": 14,
      "h": 20,
      "shape": "rect",
      "color": 14472388,
      "zone": "教学区",
      "pri": "medium",
      "desc": "西侧教学楼，5 层。"
    },
    {
      "id": "W-EDU-04",
      "name": "22号楼",
      "x": -174,
      "z": 24,
      "w": 40,
      "d": 14,
      "h": 20,
      "shape": "rect",
      "color": 14472388,
      "zone": "教学区",
      "pri": "medium",
      "desc": "西侧教学楼，5 层。"
    },
    {
      "id": "W-EDU-05",
      "name": "16号楼/第一实验大楼",
      "x": -119,
      "z": 10,
      "w": 45,
      "d": 16,
      "h": 24,
      "shape": "rect",
      "color": 14735560,
      "zone": "教学区",
      "pri": "high",
      "desc": "第一实验大楼，6 层，承担多个学院实验教学。"
    },
    {
      "id": "W-EDU-06",
      "name": "14号楼/生环实验",
      "x": -94,
      "z": -64,
      "w": 35,
      "d": 14,
      "h": 20,
      "shape": "rect",
      "color": 13683904,
      "zone": "教学区",
      "pri": "medium",
      "desc": "生物与环境学院实验楼，4 层。"
    },
    {
      "id": "W-EDU-07",
      "name": "保卫处",
      "x": -70,
      "z": -60,
      "w": 12,
      "d": 8,
      "h": 8,
      "shape": "rect",
      "color": 13157564,
      "zone": "教学区",
      "pri": "low",
      "desc": "校园保卫处，2 层小楼。"
    },
    {
      "id": "E-EDU-01",
      "name": "12号楼/共享空间",
      "x": 47,
      "z": -152,
      "w": 40,
      "d": 16,
      "h": 20,
      "shape": "rect",
      "color": 14735560,
      "zone": "教学区",
      "pri": "high",
      "desc": "共享学习空间，5 层。"
    },
    {
      "id": "E-EDU-02",
      "name": "9号楼/交叉科学研究院",
      "x": 126,
      "z": -129,
      "w": 60,
      "d": 20,
      "h": 30,
      "shape": "rect",
      "color": 14735560,
      "zone": "教学区",
      "pri": "high",
      "desc": "交叉科学研究院，5 层。"
    },
    {
      "id": "E-EDU-04",
      "name": "11号楼/青创园",
      "x": 35,
      "z": -131,
      "w": 15,
      "d": 25,
      "h": 16,
      "shape": "rect",
      "color": 13683904,
      "zone": "教学区",
      "pri": "medium",
      "desc": "创新创业空间，4 层。"
    },
    {
      "id": "SE-ADM-01",
      "name": "行政中心2",
      "x": 114,
      "z": -37,
      "w": 50,
      "d": 18,
      "h": 39,
      "shape": "rect",
      "color": 13158608,
      "zone": "行政区",
      "pri": "high",
      "desc": "校园行政办公楼，4 层。"
    },
    {
      "id": "SE-ADM-02",
      "name": "查济民大厦",
      "x": 197,
      "z": -9,
      "w": 40,
      "d": 20,
      "h": 30,
      "shape": "rect",
      "color": 12633292,
      "zone": "行政区",
      "pri": "high",
      "desc": "校园最高建筑，行政地标，12 层塔楼。"
    },
    {
      "id": "E-LIFE-01",
      "name": "2号楼",
      "x": 199,
      "z": -44,
      "w": 20,
      "d": 15,
      "h": 25,
      "shape": "rect",
      "color": 13682880,
      "zone": "生活区",
      "pri": "low",
      "desc": "东侧生活区宿舍楼，5 层。"
    },
    {
      "id": "E-LIFE-02",
      "name": "3号楼",
      "x": 247,
      "z": -41,
      "w": 30,
      "d": 12,
      "h": 20,
      "shape": "rect",
      "color": 13682880,
      "zone": "生活区",
      "pri": "low",
      "desc": "东侧生活区宿舍楼，5 层。"
    },
    {
      "id": "E-LIFE-03",
      "name": "4号楼",
      "x": 248,
      "z": -16,
      "w": 30,
      "d": 12,
      "h": 20,
      "shape": "rect",
      "color": 13682880,
      "zone": "生活区",
      "pri": "low",
      "desc": "东侧生活区宿舍楼，5 层。"
    },
    {
      "id": "E-LIFE-04",
      "name": "5号楼",
      "x": 285,
      "z": -40,
      "w": 30,
      "d": 12,
      "h": 20,
      "shape": "rect",
      "color": 13682880,
      "zone": "生活区",
      "pri": "low",
      "desc": "东侧生活区宿舍楼，5 层。"
    },
    {
      "id": "E-LIFE-05",
      "name": "6号楼",
      "x": 286,
      "z": -15,
      "w": 30,
      "d": 12,
      "h": 20,
      "shape": "rect",
      "color": 13682880,
      "zone": "生活区",
      "pri": "low",
      "desc": "东侧生活区宿舍楼，5 层。"
    },
    {
      "id": "E-LIFE-06",
      "name": "7号楼",
      "x": 286,
      "z": 11,
      "w": 30,
      "d": 12,
      "h": 20,
      "shape": "rect",
      "color": 13682880,
      "zone": "生活区",
      "pri": "low",
      "desc": "东侧生活区宿舍楼，5 层。"
    },
    {
      "id": "E-LIFE-07",
      "name": "8号楼",
      "x": 286,
      "z": 33,
      "w": 30,
      "d": 12,
      "h": 20,
      "shape": "rect",
      "color": 13682880,
      "zone": "生活区",
      "pri": "low",
      "desc": "东侧生活区宿舍楼，5 层。"
    },
    {
      "id": "NE-SPT-01",
      "name": "体育馆",
      "x": 203,
      "z": -248,
      "w": 55,
      "d": 90,
      "h": 30,
      "shape": "rect",
      "color": 12634320,
      "zone": "运动区",
      "pri": "high",
      "desc": "校园综合体育馆，大体量建筑。",
      "glb": "体育馆.glb",
      "glbScale": 0.65,
      "glbRotY": 90
    },
    {
      "id": "NE-LIFE-01",
      "name": "致勤楼西楼",
      "x": 201,
      "z": -326,
      "w": 40,
      "d": 14,
      "h": 90,
      "shape": "rect",
      "color": 13682880,
      "zone": "生活区",
      "pri": "medium",
      "desc": "东北生活区宿舍楼，6 层。"
    },
    {
      "id": "NE-LIFE-02",
      "name": "综合宿舍楼",
      "x": 200,
      "z": -371,
      "w": 45,
      "d": 16,
      "h": 110,
      "shape": "rect",
      "color": 13682880,
      "zone": "生活区",
      "pri": "medium",
      "desc": "东北生活区高层宿舍楼，8 层。"
    },
    {
      "id": "NE-LIFE-03",
      "name": "26号楼",
      "x": 270,
      "z": -155,
      "w": 35,
      "d": 14,
      "h": 20,
      "shape": "rect",
      "color": 13682880,
      "zone": "生活区",
      "pri": "medium",
      "desc": "东北生活区建筑，5 层。"
    },
    {
      "id": "NE-LIFE-04",
      "name": "艺术馆",
      "x": 336,
      "z": -97,
      "w": 30,
      "d": 18,
      "h": 12,
      "shape": "rect",
      "color": 13946056,
      "zone": "生活区",
      "pri": "medium",
      "desc": "校园艺术展览馆，3 层。"
    },
    {
      "id": "NW-LIFE-01",
      "name": "清乐园1号楼",
      "x": -397,
      "z": -130,
      "w": 35,
      "d": 12,
      "h": 24,
      "shape": "rect",
      "color": 13682880,
      "zone": "生活区",
      "pri": "low",
      "desc": "西北生活区宿舍楼，6 层。"
    },
    {
      "id": "NW-LIFE-02",
      "name": "清乐园2号楼",
      "x": -355,
      "z": -128,
      "w": 35,
      "d": 12,
      "h": 24,
      "shape": "rect",
      "color": 13682880,
      "zone": "生活区",
      "pri": "low",
      "desc": "西北生活区宿舍楼，6 层。"
    },
    {
      "id": "NW-LIFE-03",
      "name": "清乐园3号楼",
      "x": -357,
      "z": -154,
      "w": 40,
      "d": 12,
      "h": 50,
      "shape": "rect",
      "color": 13682880,
      "zone": "生活区",
      "pri": "medium",
      "desc": "西北生活区宿舍楼，6 层。"
    },
    {
      "id": "NW-LIFE-04",
      "name": "致和园2号楼",
      "x": -179,
      "z": 249,
      "w": 35,
      "d": 12,
      "h": 24,
      "shape": "rect",
      "color": 13682880,
      "zone": "生活区",
      "pri": "low",
      "desc": "西南侧生活区宿舍楼，6 层。"
    },
    {
      "id": "GATE-N",
      "name": "北校区南门",
      "x": 170,
      "z": -84,
      "w": 8,
      "d": 3,
      "h": 4,
      "shape": "gate",
      "color": 12103848,
      "zone": "出入口",
      "pri": "low",
      "desc": "校园北区入口。"
    },
    {
      "id": "COPY-1778646470046",
      "name": "清乐园3号楼 (复制)",
      "x": -399,
      "z": -154,
      "w": 40,
      "d": 12,
      "h": 50,
      "shape": "rect",
      "color": 13682880,
      "zone": "生活区",
      "pri": "medium",
      "desc": "西北生活区宿舍楼，6 层。"
    },
    {
      "id": "COPY-1778680501042",
      "name": "教学主楼 A1 (复制)",
      "x": 59,
      "z": 140,
      "w": 50,
      "d": 14,
      "h": 24,
      "shape": "rect",
      "color": 15260868,
      "zone": "教学区",
      "pri": "high",
      "desc": "南区东侧教学主楼，6 层。"
    },
    {
      "id": "COPY-1778680637719",
      "name": "15号楼2",
      "x": -144,
      "z": -67,
      "w": 30,
      "d": 14,
      "h": 20,
      "shape": "rect",
      "color": 14472388,
      "zone": "教学区",
      "pri": "medium",
      "desc": "西侧教学楼，5 层。"
    },
    {
      "id": "COPY-1778680705392",
      "name": "18号楼",
      "x": -240,
      "z": 6,
      "w": 35,
      "d": 14,
      "h": 20,
      "shape": "rect",
      "color": 14472388,
      "zone": "教学区",
      "pri": "medium",
      "desc": "西侧教学楼，5 层。"
    },
    {
      "id": "COPY-1778680781664",
      "name": "23号楼",
      "x": -174,
      "z": 43,
      "w": 40,
      "d": 14,
      "h": 20,
      "shape": "rect",
      "color": 14472388,
      "zone": "教学区",
      "pri": "medium",
      "desc": "西侧教学楼，5 层。"
    },
    {
      "id": "COPY-1778680813504",
      "name": "16号楼/第一实验大楼 (复制)",
      "x": -119,
      "z": -27,
      "w": 45,
      "d": 16,
      "h": 24,
      "shape": "rect",
      "color": 14735560,
      "zone": "教学区",
      "pri": "high",
      "desc": "第一实验大楼，6 层，承担多个学院实验教学。"
    },
    {
      "id": "COPY-1778681904516",
      "name": "2号楼 (复制)",
      "x": 183,
      "z": -37,
      "w": 10,
      "d": 30,
      "h": 15,
      "shape": "rect",
      "color": 13682880,
      "zone": "生活区",
      "pri": "low",
      "desc": "东侧生活区宿舍楼，5 层。"
    },
    {
      "id": "COPY-1778681969175",
      "name": "南校区北门",
      "x": 170,
      "z": -57,
      "w": 8,
      "d": 3,
      "h": 4,
      "shape": "gate",
      "color": 12103848,
      "zone": "出入口",
      "pri": "low",
      "desc": "校园北区入口。"
    },
    {
      "id": "COPY-1778682067878",
      "name": "12号楼/共享空间 (复制)",
      "x": 49,
      "z": -99,
      "w": 40,
      "d": 16,
      "h": 20,
      "shape": "rect",
      "color": 14735560,
      "zone": "教学区",
      "pri": "high",
      "desc": "共享学习空间，5 层。"
    },
    {
      "id": "COPY-1778682110650",
      "name": "中邮驿站",
      "x": 13,
      "z": -133,
      "w": 10,
      "d": 50,
      "h": 10,
      "shape": "rect",
      "color": 13683904,
      "zone": "教学区",
      "pri": "medium",
      "desc": "创新创业空间，4 层。"
    },
    {
      "id": "COPY-1778682256614",
      "name": "26号楼2",
      "x": 270,
      "z": -127,
      "w": 35,
      "d": 14,
      "h": 20,
      "shape": "rect",
      "color": 13682880,
      "zone": "生活区",
      "pri": "medium",
      "desc": "东北生活区建筑，5 层。"
    },
    {
      "id": "COPY-1778682267810",
      "name": "26号楼1",
      "x": 282,
      "z": -141,
      "w": 10,
      "d": 14,
      "h": 20,
      "shape": "rect",
      "color": 13682880,
      "zone": "生活区",
      "pri": "medium",
      "desc": "东北生活区建筑，5 层。"
    },
    {
      "id": "COPY-1778682315260",
      "name": "26号楼4",
      "x": 297,
      "z": -127,
      "w": 20,
      "d": 14,
      "h": 20,
      "shape": "rect",
      "color": 13682880,
      "zone": "生活区",
      "pri": "medium",
      "desc": "东北生活区建筑，5 层。"
    },
    {
      "id": "COPY-1778682459134",
      "name": "食堂",
      "x": 201,
      "z": -350,
      "w": 40,
      "d": 14,
      "h": 40,
      "shape": "rect",
      "color": 13682880,
      "zone": "生活区",
      "pri": "medium",
      "desc": "东北生活区宿舍楼，6 层。"
    },
    {
      "id": "COPY-1778682484304",
      "name": "食堂2",
      "x": 263,
      "z": -361,
      "w": 40,
      "d": 30,
      "h": 40,
      "shape": "rect",
      "color": 13682880,
      "zone": "生活区",
      "pri": "medium",
      "desc": "东北生活区宿舍楼，6 层。"
    },
    {
      "id": "COPY-1778682520483",
      "name": "致勤楼东楼",
      "x": 264,
      "z": -333,
      "w": 40,
      "d": 14,
      "h": 90,
      "shape": "rect",
      "color": 13682880,
      "zone": "生活区",
      "pri": "medium",
      "desc": "东北生活区宿舍楼，6 层。"
    },
    {
      "id": "COPY-1778682556550",
      "name": "雕塑馆",
      "x": 351,
      "z": -142,
      "w": 30,
      "d": 18,
      "h": 12,
      "shape": "rect",
      "color": 13946056,
      "zone": "生活区",
      "pri": "medium",
      "desc": "校园艺术展览馆，3 层。"
    },
    {
      "id": "COPY-1778682566654",
      "name": "结构实验室",
      "x": 306,
      "z": -153,
      "w": 30,
      "d": 18,
      "h": 12,
      "shape": "rect",
      "color": 13946056,
      "zone": "生活区",
      "pri": "medium",
      "desc": "校园艺术展览馆，3 层。"
    }
  ],
  "roads": [
    {
      "id": "ROAD-WEST-OUTER",
      "name": "西侧外部主路",
      "type": "outer",
      "width": 12,
      "points": [
        [
          -365,
          -356
        ],
        [
          -345,
          -256
        ],
        [
          -330,
          -166
        ],
        [
          -315,
          -76
        ],
        [
          -300,
          24
        ],
        [
          -285,
          124
        ],
        [
          -270,
          264
        ]
      ]
    },
    {
      "id": "ROAD-EAST-OUTER",
      "name": "东侧外部主路",
      "type": "outer",
      "width": 12,
      "points": [
        [
          506,
          -348
        ],
        [
          471,
          -248
        ],
        [
          446,
          -158
        ],
        [
          421,
          -68
        ],
        [
          396,
          32
        ],
        [
          371,
          132
        ],
        [
          346,
          272
        ]
      ]
    },
    {
      "id": "ROAD-NORTH-MAIN",
      "name": "北侧横向主路",
      "type": "main",
      "width": 8,
      "points": [
        [
          -326,
          -91
        ],
        [
          -226,
          -86
        ],
        [
          -146,
          -84
        ],
        [
          -56,
          -81
        ],
        [
          44,
          -78
        ],
        [
          139,
          -74
        ],
        [
          239,
          -69
        ],
        [
          416,
          -63
        ]
      ]
    },
    {
      "id": "ROAD-CENTER-EW",
      "name": "校园中央东西向主路",
      "type": "main",
      "width": 7,
      "points": [
        [
          -207,
          -14
        ],
        [
          -178,
          -13
        ],
        [
          -108,
          -11
        ],
        [
          -38,
          -9
        ],
        [
          42,
          -8
        ],
        [
          112,
          -7
        ],
        [
          170,
          -6
        ],
        [
          170,
          8
        ],
        [
          227,
          8
        ],
        [
          227,
          -55
        ]
      ]
    },
    {
      "id": "ROAD-SOUTH-AXIS",
      "name": "南门中轴道路",
      "type": "main",
      "width": 8,
      "points": [
        [
          -3,
          225
        ],
        [
          -3,
          185
        ],
        [
          -3,
          145
        ],
        [
          -3,
          125
        ]
      ]
    },
    {
      "id": "ROAD-EAST-TEACHING-LOOP",
      "name": "9号楼与12号楼环路",
      "type": "loop",
      "width": 6,
      "points": [
        [
          170,
          -161
        ],
        [
          170,
          -93
        ],
        [
          117,
          -95
        ],
        [
          78,
          -108
        ],
        [
          24,
          -112
        ],
        [
          23,
          -169
        ],
        [
          81,
          -166
        ],
        [
          171,
          -162
        ]
      ]
    },
    {
      "id": "ROAD-STADIUM-WEST",
      "name": "体育馆西侧南北路",
      "type": "main",
      "width": 7,
      "points": [
        [
          170,
          -311
        ],
        [
          170,
          -271
        ],
        [
          170,
          -226
        ],
        [
          170,
          -181
        ],
        [
          170,
          -141
        ],
        [
          170,
          -91
        ],
        [
          170,
          -41
        ],
        [
          170,
          -21
        ],
        [
          170,
          -1
        ],
        [
          171,
          57
        ]
      ]
    },
    {
      "id": "ROAD-EAST-LIFE-LOOP",
      "name": "东侧生活区环路",
      "type": "loop",
      "width": 7,
      "points": [
        [
          224,
          -55
        ],
        [
          285,
          -55
        ],
        [
          308,
          -54
        ],
        [
          309,
          35
        ],
        [
          308,
          53
        ],
        [
          257,
          55
        ],
        [
          205,
          55
        ]
      ]
    },
    {
      "id": "ROAD-SOUTH-ROUNDABOUT",
      "name": "南校区中轴环岛",
      "type": "loop",
      "width": 4,
      "points": [
        [
          14,
          158
        ],
        [
          12.782072520180588,
          162.59220118838107
        ],
        [
          9.313708498984761,
          166.48528137423858
        ],
        [
          4.122934917841437,
          169.08655439013543
        ],
        [
          -1.9999999999999991,
          170
        ],
        [
          -8.122934917841436,
          169.08655439013543
        ],
        [
          -13.31370849898476,
          166.48528137423858
        ],
        [
          -16.782072520180588,
          162.59220118838107
        ],
        [
          -18,
          158
        ],
        [
          -16.78207252018059,
          153.40779881161893
        ],
        [
          -13.313708498984763,
          149.51471862576142
        ],
        [
          -8.122934917841445,
          146.91344560986457
        ],
        [
          -2.000000000000003,
          146
        ],
        [
          4.12293491784144,
          146.91344560986457
        ],
        [
          9.313708498984758,
          149.51471862576142
        ],
        [
          12.782072520180584,
          153.4077988116189
        ],
        [
          14,
          158
        ]
      ]
    },
    {
      "id": "ROAD-SOUTH-CROSS-MID",
      "name": "教学区中部横向步道",
      "type": "branch",
      "width": 3,
      "points": [
        [
          -85,
          158
        ],
        [
          -50,
          158
        ],
        [
          -18,
          158
        ],
        [
          14,
          158
        ],
        [
          50,
          158
        ],
        [
          85,
          158
        ]
      ]
    },
    {
      "id": "CUSTOM-ROAD-1778682915215",
      "name": "交叉学院左侧路",
      "type": "branch",
      "width": 5,
      "points": [
        [
          73,
          -109
        ],
        [
          75,
          -139
        ],
        [
          76,
          -166
        ]
      ]
    },
    {
      "id": "CUSTOM-ROAD-1778683000944",
      "name": "新道路",
      "type": "branch",
      "width": 7,
      "points": [
        [
          168,
          -94
        ],
        [
          198,
          -94
        ],
        [
          228,
          -94
        ],
        [
          240,
          -94
        ],
        [
          237,
          -184
        ],
        [
          329,
          -179
        ],
        [
          327,
          -150
        ],
        [
          319,
          -120
        ],
        [
          311,
          -93
        ],
        [
          239,
          -94
        ]
      ]
    },
    {
      "id": "CUSTOM-ROAD-1778728714032",
      "name": "新道路",
      "type": "branch",
      "width": 7,
      "points": [
        [
          267,
          57
        ],
        [
          267,
          28
        ],
        [
          268,
          -53
        ]
      ]
    },
    {
      "id": "CUSTOM-ROAD-1778728748564",
      "name": "新道路",
      "type": "branch",
      "width": 7,
      "points": [
        [
          209,
          55
        ],
        [
          66,
          58
        ],
        [
          24,
          59
        ],
        [
          -38,
          59
        ],
        [
          -65,
          59
        ],
        [
          -65,
          -10
        ]
      ]
    },
    {
      "id": "CUSTOM-ROAD-1778728988950",
      "name": "新道路",
      "type": "branch",
      "width": 7,
      "points": [
        [
          169,
          -184
        ],
        [
          199,
          -184
        ],
        [
          229,
          -184
        ],
        [
          239,
          -184
        ],
        [
          238,
          -291
        ],
        [
          238,
          -311
        ],
        [
          230,
          -311
        ],
        [
          230,
          -400
        ]
      ]
    },
    {
      "id": "CUSTOM-ROAD-1778729234534",
      "name": "新道路",
      "type": "branch",
      "width": 7,
      "points": [
        [
          -64,
          59
        ],
        [
          -205,
          57
        ],
        [
          -204,
          -54
        ],
        [
          -217,
          -71
        ],
        [
          -253,
          -73
        ],
        [
          -261,
          -87
        ]
      ]
    },
    {
      "id": "CUSTOM-ROAD-1778729347842",
      "name": "新道路",
      "type": "branch",
      "width": 7,
      "points": [
        [
          -206,
          -51
        ],
        [
          -161,
          -51
        ],
        [
          -65,
          -48
        ],
        [
          -65,
          -10
        ]
      ]
    },
    {
      "id": "CUSTOM-ROAD-1778729429229",
      "name": "教学环路",
      "type": "branch",
      "width": 7,
      "points": [
        [
          -86,
          56
        ],
        [
          -87,
          146
        ],
        [
          -87,
          204
        ],
        [
          -87,
          217
        ],
        [
          88,
          216
        ],
        [
          87,
          58
        ]
      ]
    },
    {
      "id": "CUSTOM-ROAD-1778729550003",
      "name": "新道路",
      "type": "branch",
      "width": 7,
      "points": [
        [
          -46,
          57
        ],
        [
          -45,
          103
        ],
        [
          -44,
          123
        ],
        [
          39,
          122
        ],
        [
          37,
          56
        ]
      ]
    },
    {
      "id": "CUSTOM-ROAD-1778729692284",
      "name": "新道路",
      "type": "branch",
      "width": 7,
      "points": [
        [
          237,
          -311
        ],
        [
          267,
          -311
        ],
        [
          296,
          -311
        ],
        [
          292,
          -393
        ],
        [
          229,
          -397
        ]
      ]
    },
    {
      "id": "CUSTOM-ROAD-1778729743692",
      "name": "新道路",
      "type": "branch",
      "width": 7,
      "points": [
        [
          224,
          8
        ],
        [
          270,
          8
        ]
      ]
    },
    {
      "id": "CUSTOM-ROAD-1778729780387",
      "name": "新道路",
      "type": "branch",
      "width": 7,
      "points": [
        [
          85,
          -8
        ],
        [
          87,
          61
        ]
      ]
    }
  ]
};
